## [stage-tg](https://walter.app.spacelift.io/stack/stage-tg/run/01HXCV6FNT3GP2HXTHTTENCGVC) plan logs

<details>
<summary>Click here to expand</summary>

```
[01HX9YDYP2KVHK8KZGA0XCF20F] Planning changes with 0 custom hooks...
time=2024-05-08T19:35:53Z level=info msg=The stack at /mnt/workspace/source/infra/stage-tg will be processed in the following order for command plan:
Group 1
- Module /mnt/workspace/source/infra/stage-tg/us-east-1/playground/vpc


aws_vpc.this[0]: Refreshing state... [id=vpc-0696729d1eed84b6c]
aws_subnet.public[0]: Refreshing state... [id=subnet-06cfb09f52b6f435f]
aws_route_table.private[2]: Refreshing state... [id=rtb-0bcc7db157e66e7c6]
aws_route_table.public[0]: Refreshing state... [id=rtb-0bb2d0cee9e92c0a0]
aws_default_route_table.default[0]: Refreshing state... [id=rtb-045ad925c1572642e]
aws_subnet.database[0]: Refreshing state... [id=subnet-0981e14bdce7d2471]
aws_default_security_group.this[0]: Refreshing state... [id=sg-05180f60a6ee4d7e6]
aws_route_table.private[0]: Refreshing state... [id=rtb-0fbeb7aff22d1bea2]
aws_default_network_acl.this[0]: Refreshing state... [id=acl-03ec117ff6995a292]
aws_subnet.private[0]: Refreshing state... [id=subnet-00cc27a6cc1466316]
aws_route_table.private[1]: Refreshing state... [id=rtb-044390f05108534f6]
aws_subnet.private[1]: Refreshing state... [id=subnet-0c992e202f884e71b]
aws_subnet.private[2]: Refreshing state... [id=subnet-0c26adefb4e13c427]
aws_subnet.public[1]: Refreshing state... [id=subnet-0f296208af5c3d27b]
aws_subnet.database[1]: Refreshing state... [id=subnet-08d659489658e3ffe]
aws_subnet.public[2]: Refreshing state... [id=subnet-01b0ca4ee6437250d]
aws_subnet.database[2]: Refreshing state... [id=subnet-0a7419c299c63083b]
aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-006dc65aeb681c3d4]
aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-0f1d76209d541e4d3]
aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0454055088b707513]
aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-05b31864bb58b489d]
aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0f8702e0dfc374c4a]
aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-005d23ca769abfd95]
aws_db_subnet_group.database[0]: Refreshing state... [id=stage-tg-playground]
aws_route_table_association.database[0]: Refreshing state... [id=rtbassoc-04342c57b66bcb255]
aws_route_table_association.database[1]: Refreshing state... [id=rtbassoc-01eb09a07781b6908]
aws_route_table_association.database[2]: Refreshing state... [id=rtbassoc-010ce9a3b5ffc1bff]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[1] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_eip.nat[2] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + arn                  = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = "vpc"
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + ptr_record           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + tags_all             = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + vpc                  = (known after apply)
    }

  # aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + tags_all = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + vpc_id   = "vpc-0696729d1eed84b6c"
    }

  # aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-06cfb09f52b6f435f"
      + tags                               = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1a"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
    }

  # aws_nat_gateway.this[1] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-0f296208af5c3d27b"
      + tags                               = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1b"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
    }

  # aws_nat_gateway.this[2] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id                      = (known after apply)
      + association_id                     = (known after apply)
      + connectivity_type                  = "public"
      + id                                 = (known after apply)
      + network_interface_id               = (known after apply)
      + private_ip                         = (known after apply)
      + public_ip                          = (known after apply)
      + secondary_private_ip_address_count = (known after apply)
      + secondary_private_ip_addresses     = (known after apply)
      + subnet_id                          = "subnet-01b0ca4ee6437250d"
      + tags                               = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
      + tags_all                           = {
          + "Entity"      = "tg"
          + "Environment" = "stage-tg-playground"
          + "Name"        = "stage-tg-playground-us-east-1c"
          + "Region"      = "us-east-1"
          + "Terraform"   = "true"
          + "Tier"        = "stage"
          + "Unit"        = "playground"
        }
    }

  # aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0fbeb7aff22d1bea2"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.private_nat_gateway[1] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-044390f05108534f6"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.private_nat_gateway[2] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0bcc7db157e66e7c6"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = "rtb-0bb2d0cee9e92c0a0"
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

Plan: 11 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + igw_arn                                     = (known after apply)
  + igw_id                                      = (known after apply)
  ~ nat_ids                                     = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ nat_public_ips                              = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ natgw_ids                                   = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ natgw_interface_ids                         = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  ~ private_nat_gateway_route_ids               = [
      + (known after apply),
      + (known after apply),
      + (known after apply),
    ]
  + public_internet_gateway_route_id            = (known after apply)
time=2024-05-08T19:36:08Z level=info msg=time=2024-05-08T19:35:53Z level=warning msg=Detected that init is needed, but Auto-Init is disabled. Continuing with further actions, but subsequent terraform commands may fail. prefix=[/mnt/workspace/source/infra/stage-tg/us-east-1/playground/vpc] 

[01HX9YDYP2KVHK8KZGA0XCF20F] Successfully planned changes
[01HX9YDYP2KVHK8KZGA0XCF20F] Retrieving the dependency graph...
[01HX9YDYP2KVHK8KZGA0XCF20F] Getting path for module us-east-1/playground/vpc
[01HX9YDYP2KVHK8KZGA0XCF20F] Storing original state file for /mnt/workspace/source/infra/stage-tg/us-east-1/playground/vpc/.terragrunt-cache/7gllXhYlcAQSX5X_pZYXMcJEix8/A35GeYiqYDYXDWZftKtd1kkU5ic module
[01HX9YDYP2KVHK8KZGA0XCF20F] Uploading the list of managed resources...
[01HX9YDYP2KVHK8KZGA0XCF20F] Retrieving the dependency graph...
[01HX9YDYP2KVHK8KZGA0XCF20F] Getting path for module us-east-1/playground/vpc
[01HX9YDYP2KVHK8KZGA0XCF20F] Analyzing plan for module us-east-1/playground/vpc in directory /mnt/workspace/source/infra/stage-tg/us-east-1/playground/vpc/.terragrunt-cache/7gllXhYlcAQSX5X_pZYXMcJEix8/A35GeYiqYDYXDWZftKtd1kkU5ic
[01HX9YDYP2KVHK8KZGA0XCF20F] Uploading the list of managed resources...
[01HX9YDYP2KVHK8KZGA0XCF20F] Please be aware that the run changes calculation includes output changes.
[01HX9YDYP2KVHK8KZGA0XCF20F] Resource list upload is GO
[01HX9YDYP2KVHK8KZGA0XCF20F] Generating JSON representations of the plans...
[01HX9YDYP2KVHK8KZGA0XCF20F] Retrieving the dependency graph...
[01HX9YDYP2KVHK8KZGA0XCF20F] Getting path for module us-east-1/playground/vpc
[01HX9YDYP2KVHK8KZGA0XCF20F] Generating JSON representation of the plan for /mnt/workspace/source/infra/stage-tg/us-east-1/playground/vpc/.terragrunt-cache/7gllXhYlcAQSX5X_pZYXMcJEix8/A35GeYiqYDYXDWZftKtd1kkU5ic ...
[01HX9YDYP2KVHK8KZGA0XCF20F] Loading custom plan policy inputs...
[01HX9YDYP2KVHK8KZGA0XCF20F] 0 custom plan policy inputs found
[01HX9YDYP2KVHK8KZGA0XCF20F] No plan policies to evaluate
```

</details>